---
kind: other
id: Methods.T:Autodesk.Revit.UI.Selection.Selection
source: html/a2847bd6-bcac-9233-584f-77ca54c4a800.htm
---
# Selection Methods

Returns the ids of the elements that are currently selected within the project.
 The selection may not be complete. See GetReferences for more options.